slice_num = 3  # 水平切割的份数
max_pop_size = 30    # 最大种群大小
max_iter_size = 800    # 最大迭代次数
step = 3
conv_popt = [1.04706796e-07, 6.52876925e-06, 4.93731383e-03, -9.59855386e-01,
             6.57436585e+01, -1.83081160e+03, 1.98693668e+04, 6.79433621e+04]
fc_popt = [2.28457750e-09, -4.25494006e-09, 8.06625307e-01, -1.40473702e+02,
           8.88610637e+03, -2.08845416e+05, 2.37566153e+06, 7.15240467e+07]
# cpu = 0
# slice_num = 3  # 水平切割的份数
# max_pop_size = 1    # 最大种群大小
# max_iter_size = 1    # 最大迭代次数
# step = 3

